app/controllers/api/runs_controller.rb

  def show
    render json: Run.find(params[:id])
---
SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]