app/controllers/api/suites_controller.rb

SELECT  "suites".* FROM "suites" WHERE "suites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @suite = Suite.find(params[:id])