app/controllers/api/test_suites_controller.rb

  def index
    offset = params[:offset] || 0
    limit = params[:limit] || 20
    @test_suites = TestSuite.order('id DESC').offset(offset).limit(limit)
---
SELECT  "test_suites".* FROM "test_suites" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]

  def create
    input = JSON.parse(request.body.read)
    @test_suite = TestSuite.new input
    @test_suite.save!
---
INSERT INTO "test_suites" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "TS1222"], ["created_at", 2016-10-13 09:38:12 UTC], ["updated_at", 2016-10-13 09:38:12 UTC]]

  def show
    @test_suite = TestSuite.find params[:id]
---
SELECT  "test_suites".* FROM "test_suites" WHERE "test_suites"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]