app/controllers/api/tests_controller.rb

  def index
    offset = params[:offset] || 0
    limit = params[:limit] || 20
    @tests = Test.order('id DESC').offset(offset).limit(limit)
---
SELECT  "tests".* FROM "tests" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]

  def create
    input = JSON.parse(request.body.read)
    @test = Test.new input
    @test.test_run = TestRun.find params[:test_run_id]
    @test.save!
---
SELECT  "test_runs".* FROM "test_runs" WHERE "test_runs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "tests" ("name", "start_time", "test_run_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test_1_6796"], ["start_time", Thu, 13 Oct 2016], ["test_run_id", 3], ["created_at", 2016-10-13 12:23:12 UTC], ["updated_at", 2016-10-13 12:23:12 UTC]]

  def show
    @test = Test.find params[:id]
---
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]