app/controllers/api/test_runs_controller.rb

SELECT  "test_suites".* FROM "test_suites" WHERE "test_suites"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "test_runs" ("name", "start_time", "test_suite_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "TestRun1818"], ["start_time", Thu, 13 Oct 2016], ["test_suite_id", 2], ["created_at", 2016-10-13 12:21:13 UTC], ["updated_at", 2016-10-13 12:21:13 UTC]]
---
  def create
    input = JSON.parse(request.body.read)
    @test_run = TestRun.new input
    @test_run.test_suite = TestSuite.find params[:test_suite_id]
    @test_run.save!