app/views/runs/index.html.erb

          <td><%= run.tester_name %></td>
          <td><button type="button" class="btn btn-block <%= Result.find(run.result_id).display_style_btn %> btn-xs"><%= Result.find(run.result_id).name %></button></td>
---
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]