app/controllers/runs_controller.rb

SELECT "runs".* FROM "runs"
---
  def index
    @runs = Run.all

SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @run = Run.find(params[:id])