app/controllers/suites_controller.rb

  def index
    @suites = Suite.all
---
SELECT "suites".* FROM "suites"

  def show
    @suite = Suite.find(params[:id])
---
SELECT  "suites".* FROM "suites" WHERE "suites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]