app/controllers/tests_controller.rb

  def index
    @run = Run.find(params[:run_id])
    @tests = @run.tests.includes(:result)
---
SELECT  "runs".* FROM "runs" WHERE "runs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."run_id" = ?  [["run_id", 1]]

  def show
    @test = Test.find(params[:id])
---
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]