app/views/tests/index.html.erb

SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <td><%= test.display_duration %></td>
          <td><button type="button" class="btn btn-block <%= Result.find(test.result_id).display_style_btn %> btn-xs"><%= Result.find(test.result_id).name %></button></td>